app/Controllers/koperasiController.php

    public function index()
    {

            $query = $this->koperasiModel->findAll(); //ambil data dari tabel koperasi
---
SELECT *
FROM `koperasi`