app/Controllers/penanggungjawabController.php

SELECT *
FROM `penanggungjawab`
---
    public function index()
    {

            $query = $this->penanggungjawabModel->findAll(); //ambil data dari tabel penanggungjawab